app/controllers/client/client_sessions_controller.rb

SELECT * FROM `clients` WHERE (LOWER(`clients`.email) = 'luca.soave@gmail.com') LIMIT 1
---
  def create
    @client_session = ClientSession.new(params[:client_session])
    if @client_session.save
      @current_client = Client.find_by_email(@client_session.email)