app/controllers/admin/galleries_controller.rb

SELECT * FROM `galleries` WHERE (`galleries`.`id` = 1)
---
  def destroy
    @gallery = current_photographer.galleries.find(params[:id])