app/controllers/admin/gallery_photos_controller.rb

SELECT * FROM `photographers` WHERE (perishable_token = 'vv3Zx-mmgATD7Vpx1NfP' and updated_at > '2010-06-19 19:30:00') LIMIT 1
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 6)
INSERT INTO `gallery_photos` (`position`, `image_file_name`, `created_at`, `title`, `image_file_size`, `f_number`, `featured`, `updated_at`, `image_content_type`, `camera_brand`, `camera_model`, `iso_speed_rating`, `focal_length`, `featured_position`, `shot_at`, `height`, `exposure_time`, `image_updated_at`, `gallery_id`, `width`) VALUES(1, '3016455288_546e7e05b9_b.jpg', '2010-06-19 19:40:01', '3016455288 546e7e05b9 B', 161544, NULL, 1, '2010-06-19 19:40:01', 'image/jpeg', NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, '2010-06-19 19:40:00', 6, NULL)
---
  def flash_upload
    # validate the perishable_token param
    if params[:perishable_token]
      # find the photographer by perishable_token
      @photographer = Photographer.find_using_perishable_token(params[:perishable_token])
      gallery = @photographer.galleries.find(params[:gallery_id])
      gallery_photo = gallery.gallery_photos.new(params[:gallery_photo])
      # need to assign the correct content type becuase this is missing from a flash upload
      gallery_photo.image_content_type = MIME::Types.type_for(gallery_photo.image_file_name).to_s
      if gallery_photo.save