app/controllers/admin/pages_controller.rb

INSERT INTO `pages` (`position`, `intro`, `image_file_name`, `created_at`, `title`, `body`, `image_file_size`, `updated_at`, `image_content_type`, `photographer_id`, `cached_slug`, `image_updated_at`, `keywords`) VALUES(1, 'I and welcome, here is my gallery ...', NULL, '2010-06-28 17:26:32', 'About', 'I\'m an aspirant writer, photographer, blogger, chronic procrastinator in pursuit of happyness. ', NULL, '2010-06-28 17:26:32', NULL, 1, NULL, NULL, 'about photography, photo, gallery, still life')
---
  def create
    @page = Page.create(params[:page])

UPDATE `pages` SET `updated_at` = '2010-06-28 19:28:08', `image_file_size` = 977545, `image_file_name` = '4591931573_f835d95025_o.jpg', `image_updated_at` = '2010-06-28 19:28:04', `image_content_type` = 'image/jpeg', `body` = 'I\'m an aspirant writer, photographer, blogger, chronic procrastinator in pursuit of happyness. \r\n\r\n' WHERE `id` = 1
---
  def update
    @page.update_attributes params[:page]

DELETE FROM `pages` WHERE `id` = 1
---
  def destroy
    @page.destroy

SELECT * FROM `pages` WHERE (photographer_id = 1) ORDER BY position DESC LIMIT 1
---
    def load_resource
      @page = Page.find params[:id]