app/controllers/admin/photographer_password_resets_controller.rb

SELECT * FROM `photographers` WHERE (`photographers`.`email` = 'novara.laura@gmail.com') LIMIT 1
---
  def create
    @photographer = Photographer.find_by_email(params[:email])

UPDATE `photographers` SET `failed_login_count` = 0, `updated_at` = '2010-06-04 09:04:57', `crypted_password` = '943bee3db7d0c0ae2e994409d42a48f0add9f9304a086e9a214cd2128e9a512194528777b7c16294081edbaf2321609547ad22f7c277cee3d98c0ed16441564a', `perishable_token` = 'C-PCZhyBn6tgwFJLS46t', `last_login_at` = '2010-06-02 14:10:26', `last_login_ip` = '127.0.0.1', `current_login_at` = '2010-06-04 09:04:57', `password_salt` = 'xosmUL6Y8kbUqk8-nlwP', `login_count` = 2, `persistence_token` = 'd0a83f7c3eced3fef1d173d2c7103c0e1ea2563ea111a3f33afd38820038e52b2ce887dfc5e68b7e0ab24cbd8a19f4681f2fd3ef91a9f15ae892fbf111cc27db' WHERE `id` = 1
---
  def update
    @photographer.password = params[:photographer][:password]
    if @photographer.save

SELECT * FROM `photographers` WHERE (perishable_token = 'TFS7vnAfmlxNcwoSPSYn' and updated_at > '2010-06-04 08:54:57') LIMIT 1
---
    def load_photographer_using_perishable_token
      @photographer = Photographer.find_using_perishable_token(params[:id])