app/controllers/admin/quotes_controller.rb

  def update
    @quote = current_photographer.quotes.find(params[:id])
---
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 2 AND (`quotes`.photographer_id = 1)) ORDER BY position

  def destroy
    @quote = current_photographer.quotes.find(params[:id])
---
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 1 AND (`quotes`.photographer_id = 1)) ORDER BY position