app/controllers/galleries_controller.rb

  def show
    show! do
      @page_title = "#{@gallery.title} Gallery"
      @page_keywords = @gallery.keywords.blank? ? "#{@gallery.title.downcase}, gallery, photography, portraits, professional" : @gallery.keywords
      @page_description = @gallery.description
      @galleries = Gallery.find :all, :order => 'position'
---
SELECT * FROM `galleries` WHERE (`galleries`.photographer_id = 1) ORDER BY position