app/controllers/home_controller.rb

SELECT * FROM `galleries` WHERE (`galleries`.photographer_id = 1) ORDER BY position
SELECT * FROM `pages` ORDER BY position
SELECT * FROM `photographers` LIMIT 1
---
  def index
    @page_title = @config.home_page_title ||= 'Photographer'
    @galleries = @config.galleries.find :all

SELECT * FROM `pages` ORDER BY position
SELECT * FROM `quotes` ORDER BY position
---
    def load_pages
      @pages = Page.find :all, :order => 'position'
      @quotes = Quote.find :all, :order => 'position'