app/controllers/pages_controller.rb

  def show
    @page = Page.find params[:id]
---
SELECT * FROM `pages` ORDER BY position